{
  "courses": [
    {
      "id": "0600",
      "title": "Studio in Art",
      "department": "Art",
      "credits": 0.5,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Visual Arts", "Creative Expression"],
      "prerequisites": "None",
      "description": "Enjoy the freedom of self-expression while learning about how artists use the structure of art to create two-dimensional and three-dimensional art forms. You will use a variety of materials to help expand your creative and artistic skills. In addition, you will learn how artists think and how they develop their ideas through reflection, critical analysis, and revision. Successful completion of this course will allow you to enter all level one courses."
    },
    {
      "id": "0611",
      "title": "Studio in Drawing and Painting I",
      "department": "Art",
      "credits": 0.5,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Visual Arts", "Creative Expression"],
      "prerequisites": "Studio in Art",
      "description": "Basic drawing skills are fundamental to all other visual art forms. This course will teach you how to tap into your creative self through drawing and painting. A variety of techniques and materials will be used to develop vibrant artworks with line, value, texture, and color. Experiences will include contour, modeling form, and expressive approaches. Different drawing and painting media and methods will be explored, challenging your creativity while giving you the necessary tools to realize your visions."
    },
    {
      "id": "0612",
      "title": "Studio in Drawing and Painting II",
      "department": "Art",
      "credits": 0.5,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Visual Arts", "Creative Expression"],
      "prerequisites": "Studio in Art, Studio in Drawing & Painting I and teacher recommendation",
      "description": "In Drawing and Painting II you will continue to develop your skills and a personal, creative vision by producing ambitious projects with greater focus on design, conceptual considerations, and self-expression. Examples of contemporary fine arts will serve as a springboard for your work. You may use unconventional art media, and you will have greater freedom to develop work on your own initiative."
    },
    {
      "id": "0613",
      "title": "Studio in Ceramics I",
      "department": "Art",
      "credits": 0.5,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Visual Arts", "Creative Expression"],
      "prerequisites": "Studio in Art",
      "description": "Energize your school day with creative experiences in clay. The basic hand-built ceramic methods of pinch, coil, drape molding, and slab construction will be explored in the creation of several interesting and colorfully glazed projects."
    },
    {
      "id": "0614",
      "title": "Studio in Ceramics II",
      "department": "Art",
      "credits": 0.5,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Visual Arts", "Creative Expression"],
      "prerequisites": "Studio in Art, Studio in Ceramics I and teacher recommendation",
      "description": "Individual creative growth and experimentation are the emphases in this advanced ceramics course. While Ceramics I focused on gaining control of the clay, Ceramics II will allow you to create larger and more conceptual work. Advanced methods in ceramic art will be introduced. Learning the potters' wheel is a major objective in this course."
    },
    {
      "id": "0630",
      "title": "Studio in Ceramics III",
      "department": "Art",
      "credits": 0.5,
      "grade_levels": [10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Visual Arts", "Creative Expression"],
      "prerequisites": "Studio in Art, Studio in Ceramics I, II",
      "description": "Ceramics 3 is an advanced level class designed for students who would like to further develop their skills with clay. Students will produce work that demonstrates advanced knowledge of three dimensional design, while developing artistic concepts relevant to them, as art makers."
    },
    {
      "id": "0615",
      "title": "Studio in Sculpture I",
      "department": "Art",
      "credits": 0.5,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Visual Arts", "Creative Expression"],
      "prerequisites": "Studio in Art",
      "description": "Enter the third dimension in this introductory sculpture class. In this course, explore a variety of contemporary and historical sculpture techniques. If you like to construct, model, design and create three-dimensional works of art, this course is for you."
    },
    {
      "id": "0616",
      "title": "Studio in Sculpture II",
      "department": "Art",
      "credits": 0.5,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Visual Arts", "Creative Expression"],
      "prerequisites": "Studio in Art, Studio in Sculpture I and teacher recommendation",
      "description": "Individual expression and creative growth make up the heart of this advanced sculpture course. Professional presentation through increased technical proficiency will allow you to create larger and more conceptual pieces."
    },
    {
      "id": "0617",
      "title": "Studio in Printmaking I",
      "department": "Art",
      "credits": 0.5,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Visual Arts", "Creative Expression"],
      "prerequisites": "Studio in Art",
      "description": "What do Rembrandt and Andy Warhol have in common? They were both accomplished printmakers who portrayed daily life through a type of media that could reach everyone in their societies. In this introductory course, you will learn processes such as etching, screen-printing and mono-prints that produce multiple prints of an image."
    },
    {
      "id": "0618",
      "title": "Studio in Printmaking II",
      "department": "Art",
      "credits": 0.5,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Visual Arts", "Creative Expression"],
      "prerequisites": "Studio in Art, Studio in Printmaking I and teacher recommendation",
      "description": "In Printmaking II, you will continue to learn more advanced and ambitious print methods and skills. You will develop a body of work that explores personal themes and concepts in depth."
    },
    {
      "id": "0619",
      "title": "Design and Illustration",
      "department": "Art",
      "credits": 0.5,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Visual Arts", "Technology", "Creative Expression"],
      "prerequisites": "Studio in Art",
      "description": "Graphic designers and illustrators play an important role in our daily lives. They create artwork that visually communicates a message to an audience. Logo designs, magazine layouts, packaging and book illustrations are just a few of the many things they create. In this course, you will experience each step of the design process from brainstorming, to preliminary sketches to final products. Both traditional art materials as well as computer graphics programs such as Adobe Illustrator and Photoshop will be used."
    },
    {
      "id": "0621",
      "title": "Art of the Western World",
      "department": "Art",
      "credits": 0.5,
      "grade_levels": [11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Visual Arts", "History", "Cultural Studies"],
      "prerequisites": "None",
      "description": "Does art reflect or define culture and history? Why can't today's art world just forget about the past? Learn how European and American art have worked within their cultures to influence and reflect change. Studio projects will enhance studies. Gallery and museum visits may be included."
    },
    {
      "id": "0622",
      "title": "Art of Africa, Asia & the Americas",
      "department": "Art",
      "credits": 0.5,
      "grade_levels": [11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Visual Arts", "Cultural Studies", "World Cultures"],
      "prerequisites": "None",
      "description": "If you would like to visually travel through Africa, India, China, Japan, Australia, South America, Mexico and Native North America then this is the class for you. The emphasis will be on recognizing and appreciating the aesthetic differences of these wonderfully diverse cultures. The opportunity to explore cultures through various studio projects will accompany traditional learning methods. Field trips to galleries or museums may be included."
    },
    {
      "id": "0623",
      "title": "Fine Art Photography",
      "department": "Art",
      "credits": 0.5,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Visual Arts", "Technology", "Creative Expression"],
      "prerequisites": "Studio in Art",
      "description": "Have you ever wanted to build your own camera or learn how to print a photograph onto a piece of plain drawing paper? In this course, you will learn alternative photographic processes, work in the darkroom, use Polaroid and other instant films as well as dabble in some digital imaging. Individual interpretation of subject matter while studying unconventional trends in photography will be emphasized. Previous knowledge of photography is not required but helpful."
    },
    {
      "id": "0624",
      "title": "Honors Art",
      "department": "Art",
      "credits": 1,
      "grade_levels": [12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Honors"],
      "interest_areas": ["Visual Arts", "Creative Expression"],
      "prerequisites": "Teacher recommendation plus three art courses that should include both two and three-dimensional experiences",
      "description": "If you are a motivated 12th grade student interested in stretching the boundaries of your understanding, creativity, and skills in art. In Honors Art you will have greater freedom to create an in-depth and expressive series of works in the manner of a professional artist. You will explore a wide variety of contemporary and diverse art forms. An exit portfolio will be developed. Work produced in this class can be used for college entrance portfolios. You may choose to submit an AP portfolio to the College Board in May for an AP grade and possible college credit."
    },
    {
      "id": "0625",
      "title": "Interior Design",
      "department": "Art",
      "credits": 0.5,
      "grade_levels": [10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Visual Arts", "Design", "Career Preparation"],
      "prerequisites": "Studio in Art",
      "description": "Designing interior spaces through color, texture, emphasis, shape and much more is what will be explored in Interior Design. You will learn to incorporate furniture styles and arrangement in one and two point perspective room drawings using materials that actual designers use. These skills will be applied to scale drawings and floor plans to create the interior of an entire house as well as computer programs used for Interior Design."
    },
    {
      "id": "0626",
      "title": "Elements of Fashion",
      "department": "Art",
      "credits": 0.5,
      "grade_levels": [10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Visual Arts", "Design", "Fashion"],
      "prerequisites": "None",
      "description": "Interested in developing a sense of personal style and exploring the role of fashion in everyday life? Elements of Fashion will walk you through the history of fashion and designers with an emphasis on fads and trends as well as creating with the elements and principles of design. Careers in the field, marketing, fashion illustration as well as working with new and used materials to create wearable items will also be explored."
    },
    {
      "id": "0628",
      "title": "Art and Identity",
      "department": "Art",
      "credits": 0.5,
      "grade_levels": [11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Medium/High"],
      "interest_areas": ["Visual Arts", "Cultural Studies", "Social Issues"],
      "prerequisites": "None",
      "description": "How do we assert our identities in this loud and sometimes judgmental world? Through their art, artists can teach us about who they are, where they're from and how they feel about a variety of social and political issues. Major events in the early 21st century may have highlighted the differences among us, causing conflict and misunderstanding. This course seeks to help us learn about each other in a way that generates understanding and positive action. Art projects and interrelated information will be combined resulting in a comprehensive study of contemporary American culture through the visual arts."
    },
    {
      "id": "0629",
      "title": "America's Visual Edge",
      "department": "Art",
      "credits": 0.5,
      "grade_levels": [10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Medium/High"],
      "interest_areas": ["Visual Arts", "American Culture", "Media"],
      "prerequisites": "None",
      "description": "Body art, tattoos, and graffiti are cutting edge artistic processes...but are they? All of them have ancient origins. Find out how American art of the 21st century drives our economy, our politics, and our country while still maintaining deep roots. Plus, explore how the American visual experience is exploited as propaganda by those in power who would have us think and act as they intend. Participants may take this course for credit in either Art or Social Studies, but not for both."
    },
    {
      "id": "0631",
      "title": "Graphic Novels",
      "department": "Art",
      "credits": 0.5,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Visual Arts", "Literature", "Creative Expression"],
      "prerequisites": "Studio in Art",
      "description": "Do you like reading graphic novels and comic books? Interested in creating your own graphic novel? In this course we will read and study a variety of graphic novels. You will also learn the techniques and fundamentals of drawing action figures, manga, creating storyboards and characterization. The culmination of the course will have you creating your own graphic novel in a style of your choosing."
    },
    {
      "id": "0300",
      "title": "Career Planning & Management",
      "department": "Business",
      "credits": 1,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Career Preparation", "Life Skills"],
      "prerequisites": "None",
      "description": "This course is designed to equip students with the knowledge and skills needed to make informed decisions about their future careers, whether they plan to enter the workforce directly after high school or pursue further education. Through a combination of classroom instruction, practical exercises, and project-based learning, students will gain a comprehensive understanding of the world of work and the steps needed to achieve their career goals. Students will be empowered to become proactive, goal-oriented individuals who are well-prepared for their future professional endeavors."
    },
    {
      "id": "0303",
      "title": "Personal Law",
      "department": "Business",
      "credits": 0.5,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Law", "Life Skills"],
      "prerequisites": "None",
      "description": "Personal Law develops an understanding of how law affects personal and occupational pursuits. This course will explore topics such as when to hire a lawyer, how to settle a dispute, discrimination, rights & responsibilities in the workplace, and how to avoid being taken advantage of as a consumer."
    },
    {
      "id": "0304",
      "title": "Business Law",
      "department": "Business",
      "credits": 1,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Law", "Business", "Career Preparation"],
      "prerequisites": "None",
      "description": "In Business Law, student-interactive debates and mock trials, current events discussions, guest speakers, and analysis of real cases are some of the various ways that the material is covered and applied. This course educates students on an assortment of legal concepts that affect the business world while at the same time showing students how they may be impacted personally in real-life situations. The material that students will learn includes the legal system and its foundations, court systems, criminal law, civil law and torts, business organizations, property law, contracts, trial procedures, employment law, and much more."
    },
    {
      "id": "0313",
      "title": "College Success Skills",
      "department": "Business",
      "credits": 0.5,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Study Skills", "College Preparation"],
      "prerequisites": "None",
      "description": "This course is for students who want to learn how to process information from lectures and textbooks quickly. This course will teach students techniques for note taking, studying, test taking, and reading. Students will also identify their individual learning styles, learn how to identify their instructors' teaching styles, and be able to utilize this information to their academic advantage. The goal of this course is to teach students how to learn more in less time!"
    },
    {
      "id": "0321",
      "title": "Leadership Skills Development",
      "department": "Business",
      "credits": 0.5,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Leadership", "Life Skills", "Career Preparation"],
      "prerequisites": "None",
      "description": "This course is designed to prepare students for the rigors of college, career and professional success. This course will develop leadership skills, problem-solving/decision-making skills, communication skills, group dynamics, time management skills, public speaking skills, human relations skills, team building skills all while emphasizing leading with character. This course can help all students develop leadership skills and may also be of interest to current or potential STAP-Comm students."
    },
    {
      "id": "0330",
      "title": "Personal Finance",
      "department": "Business",
      "credits": 0.5,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Finance", "Life Skills"],
      "prerequisites": "None",
      "description": "This course seeks to teach students how to make informed decisions to reach personal financial goals. It targets five curricular units: income, money management, spending and credit, savings and investing, and risk management. Students will become financially savvy, a much needed skill in today's complex economy. The curriculum will allow students to explore the complete financial planning process and apply their knowledge using stimulating exercises and projects."
    },
    {
      "id": "0331",
      "title": "Accounting Principles I",
      "department": "Business",
      "credits": 1,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Accounting", "Business", "Career Preparation"],
      "prerequisites": "None",
      "description": "This first year course will give students a thorough background in the accounting procedures used to operate a business. This background will be helpful for future employment as an accountant and as preparation for studying business courses at the college level."
    },
    {
      "id": "0332",
      "title": "Accounting Principles II",
      "department": "Business",
      "credits": 1,
      "grade_levels": [10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Accounting", "Business", "Career Preparation"],
      "prerequisites": "Accounting Principles I",
      "description": "Students will learn to use accounting as a source of information and as a tool for effective decision-making. They will understand financial accounting and learn to develop, analyze and interpret financial statements. Students will also be better equipped to make personal financial decisions. Computer and Internet applications will be utilized."
    },
    {
      "id": "0334",
      "title": "Banking and Credit",
      "department": "Business",
      "credits": 0.5,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Finance", "Banking", "Life Skills"],
      "prerequisites": "None",
      "description": "This course provides students with a fundamental understanding of the banking industry, financial institutions, and the principles of credit management. Students will explore the roles and functions of banks in the modern financial system, as well as the various types of financial services they offer to individuals and businesses including responsible credit usage. This course empowers students to make informed financial decisions."
    },
    {
      "id": "0340",
      "title": "iComp I (Integrated Computers)",
      "department": "Business",
      "credits": 0.5,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Technology", "Computer Skills"],
      "prerequisites": "None",
      "description": "This course will focus on teaching students how to effectively integrate computers into their academic, professional and personal lives. The students will develop high skill and confidence levels using common applications such as the Microsoft Office Suite. Students will learn how to be digitally literate and good digital citizens while using a variety of software to complete both individual and collaborative projects."
    },
    {
      "id": "0342",
      "title": "iComp II",
      "department": "Business",
      "credits": 0.5,
      "grade_levels": [10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Technology", "Computer Skills", "College Preparation"],
      "prerequisites": "iComp I",
      "description": "This hands-on course is designed for the college-bound student who wants to further develop his/her skills using Microsoft Office. Students will cover advanced word processing, databases, spreadsheets, and desktop publishing. At the conclusion of the course students will have the computer skills to help them succeed at the college level and in the workplace."
    },
    {
      "id": "0381",
      "title": "Principles of Marketing",
      "department": "Business",
      "credits": 1,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Marketing", "Business", "Career Preparation"],
      "prerequisites": "None",
      "description": "This course will introduce students to the important role that marketing plays in our economic system. Content revolves around the basic marketing functions of financing, risk management, selling, promotion, pricing, purchasing, marketing information management, product/service/idea planning, and distribution. Students will refine entry-level employment skills, as well as develop more advanced career-sustaining skills, all while exploring the many career areas available in this field."
    },
    {
      "id": "0382",
      "title": "Sports Management",
      "department": "Business",
      "credits": 0.5,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Sports", "Management", "Career Preparation"],
      "prerequisites": "None",
      "description": "Introductory business principles will be examined through an investigation of the scope of the sport industry. Functions of management, skills and attributes required of a sport manager and roles of a manager are discussed. Attention focused on how the managerial process relates to sport organizations and their products. Students will become acquainted with career opportunities in the sport management field."
    },
    {
      "id": "0383",
      "title": "Entrepreneurship",
      "department": "Business",
      "credits": 0.5,
      "grade_levels": [9, 10, 11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Business", "Entrepreneurship", "Career Preparation"],
      "prerequisites": "None",
      "description": "Discover the essentials of starting and promoting a business in this hands-on course. Students will learn how to develop business ideas, create plans, and manage finances, while also mastering advertising techniques to reach target audiences. Through real-world projects, students will design marketing campaigns, pitch ideas, and collaborate on team challenges, building skills in leadership, creativity, and strategic thinking."
    },
    {
      "id": "0390",
      "title": "Career Exploration Internship Program",
      "department": "Business",
      "credits": 0.5,
      "grade_levels": [12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Career Preparation", "Work Experience"],
      "prerequisites": "Application (usually during January of Junior Year), and faculty recommendations",
      "description": "The Internship Program offers students the opportunity to gain hands-on experience in a professional setting related to their career field of interest. This program bridges academic learning with real-world application, allowing students to integrate theoretical knowledge with practical skills while contributing to the daily operations of an organization. Students will work under the guidance of industry professionals and develop a deeper understanding of their chosen field."
    },
    {
      "id": "1400",
      "title": "English 9",
      "department": "English",
      "credits": 1,
      "grade_levels": [9],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Language Arts", "Literature", "Writing"],
      "prerequisites": "None",
      "description": "English 9 develops a broad range of language arts skills. Reading, writing, grammar, vocabulary, spelling, listening, speaking, and research skills are addressed. In addition, students are introduced to interdisciplinary work and a variety of genres, including non-fiction. The course is designed to help students performing at various levels of achievement to prepare for the New York State Regents Examination in ELA."
    },
    {
      "id": "1402",
      "title": "English 9 Honors",
      "department": "English",
      "credits": 1,
      "grade_levels": [9],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Honors"],
      "interest_areas": ["Language Arts", "Literature", "Writing"],
      "prerequisites": "8th-grade ELA and teacher recommendation",
      "description": "English 9 Honors is for highly motivated ninth-graders with demonstrated interest and ability in English who possess a solid, self-directed work ethic. The course provides instruction in writing and reading methods. The analytical study of literature is stressed, as is grammar and vocabulary development. During the summer break and over the course of the school year, students read many full-length works and explore a number of different genres including drama, the novel, poetry, short fiction, and non-fiction."
    },
    {
      "id": "1410",
      "title": "English 10",
      "department": "English",
      "credits": 1,
      "grade_levels": [10],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Language Arts", "Literature", "Writing"],
      "prerequisites": "9th grade English",
      "description": "English 10 continues to develop a broad range of language arts skills introduced in English 9. Emphasis is placed on reading, writing, grammar, vocabulary, spelling, listening, speaking, and research skills. Students read, discuss and analyze non-fiction writings, stories, plays, poetry, and novels. This course is designed to help students meet or exceed the New York State Next Generation Learning Standards and to prepare for the New York State Regents Examination in ELA."
    },
    {
      "id": "1413",
      "title": "English 10 Honors",
      "department": "English",
      "credits": 1,
      "grade_levels": [10],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Honors"],
      "interest_areas": ["Language Arts", "Literature", "Writing"],
      "prerequisites": "English 9 Honors or English 9R with teacher recommendation",
      "description": "English 10 Honors is designed for the highly motivated student who possesses a consistent and conscientious work ethic as well as advanced abilities in reading, writing, and critical thinking. This class requires that students actively and thoughtfully read, analyze, and discuss several works of literature, including fiction, nonfiction, poetry, and drama. Both proper grammar use and vocabulary development continue to be stressed."
    },
    {
      "id": "1420",
      "title": "English 11 Regents",
      "department": "English",
      "credits": 1,
      "grade_levels": [11],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Language Arts", "American Literature", "Writing"],
      "prerequisites": "English 10",
      "description": "English 11 covers a survey of American Literature with a focus on literary elements that will best address the New York State Regents ELA Exam. This course also includes an exploration and study of MLA style research skills and practices. Frequent reading and writing assignments are given with focus on English grammar, vocabulary, punctuation, spelling, and other skills necessary for mastery writing."
    },
    {
      "id": "1423",
      "title": "AP English Language & Composition",
      "department": "English",
      "credits": 1,
      "grade_levels": [11],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["AP"],
      "interest_areas": ["Language Arts", "Advanced Literature", "Writing"],
      "prerequisites": "English 10 Honors with teacher recommendation or English 10R with teacher recommendation",
      "description": "Advanced Placement English Language and Composition is for the highly motivated student with superior skills in reading, writing, grammar, and critical thinking. Students read a variety of texts, both nonfiction and fiction. Students will focus analytically on what authors and orators say and how they intentionally use language to convey information with the purpose to persuade. The course equally focuses on refining and polishing the students' own writing."
    },
    {
      "id": "1429",
      "title": "AP English Literature & Composition",
      "department": "English",
      "credits": 1,
      "grade_levels": [12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["AP"],
      "interest_areas": ["Language Arts", "Advanced Literature", "Writing"],
      "prerequisites": "English 11R and teacher recommendation or AP Language and Composition",
      "description": "Advanced Placement Literature and Composition is a study of canonical works of literature from various time periods and cultural perspectives. Students intensively read a variety of prose and poetry. Literature will include poetry, drama, and fiction. Class activities focus on reading discussions and the building of analytical writing skills. Students are encouraged to take the Advanced Placement Exam in English Literature and Composition in May."
    },
    {
      "id": "1440",
      "title": "English Composition",
      "department": "English",
      "credits": 0.5,
      "grade_levels": [11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Writing", "College Preparation"],
      "prerequisites": "English 11 and/or teacher recommendation",
      "description": "College bound or not, this is the course for you! English Composition accommodates students of varying writing abilities. No matter where you are as a writer, you will learn new strategies to further improve and polish your current level/style. You write in a variety of modalities such as narrative, descriptive, persuasive, and expository. Emphasis is placed on grammar, sentence structure, mechanics, usage, and vocabulary development."
    },
    {
      "id": "1450",
      "title": "Contemporary Authors",
      "department": "English",
      "credits": 0.5,
      "grade_levels": [11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Literature", "Modern Writing"],
      "prerequisites": "English 11 and/or teacher recommendation",
      "description": "Contemporary Authors is a survey course designed to acquaint students with a wide range of literary genres. Students read and analyze novels, dramas, essays, short stories, poems, non-fiction works and other forms of writing for their styles and thematic content. Periodic quizzes, tests, critical essays and research papers, research projects and/or oral presentations are used as a basis for evaluation of student progress."
    },
    {
      "id": "1455",
      "title": "Literature of American Conflict",
      "department": "English",
      "credits": 0.5,
      "grade_levels": [11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Literature", "American History", "War Studies"],
      "prerequisites": "English 11 and/or teacher recommendation",
      "description": "The Literature of American Conflict is a survey of American literature of varying genres designed for those students interested in a literary perspective on the wars and conflicts that have shaped America. Students will read, analyze and write about non-fiction, poetry, and fictional prose with themes of conflict. The course will move chronologically, beginning with an examination of Colonial and Revolutionary literature, moving through the major struggles of the 19th and 20th centuries, and culminating in an examination of the literature of contemporary conflicts."
    },
    {
      "id": "1456",
      "title": "Fright Fiction",
      "department": "English",
      "credits": 0.5,
      "grade_levels": [11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Literature", "Horror Fiction", "Creative Expression"],
      "prerequisites": "English 11 and/or teacher recommendation",
      "description": "Fright Fiction is a course designed to acquaint students with some of the most popular literature ever written. Students will read, analyze and write about the poetry and fiction of horror, beginning with classical works such as Bram Stoker's Dracula, and progressing through more contemporary works."
    },
    {
      "id": "1460",
      "title": "Creative Writing Workshop",
      "department": "English",
      "credits": 0.5,
      "grade_levels": [11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Writing", "Creative Expression"],
      "prerequisites": "English 11 and/or teacher recommendation",
      "description": "If you believe that stories matter and you want to find your voice, Creative Writing Workshop will be a great fit for you. If you have an imagination that's just yearning to break free from the confines of formal essay writing, take a chance on this writing elective. The Creative Writing Workshop is designed for students who value expression and enjoy writing. In this class, students experiment with various genres and forms of writing to gain the skill and discipline of a creative writer."
    },
    {
      "id": "1461",
      "title": "Drama",
      "department": "English",
      "credits": 0.5,
      "grade_levels": [11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Drama", "Performance", "Literature"],
      "prerequisites": "English 11 and/or teacher recommendation",
      "description": "Drama is an introductory course designed to teach skills in reading and writing through performance assessment. During the course of study, students will focus on literacy skills, text analysis, and text creation through tableau, pantomime, improvisation, playwriting, voice, and Shakespeare. Active participation and attendance are mandatory."
    },
    {
      "id": "1462",
      "title": "Journalism",
      "department": "English",
      "credits": 0.5,
      "grade_levels": [11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Writing", "Media", "Current Events"],
      "prerequisites": "English 11 and/or teacher recommendation",
      "description": "The Journalism course teaches the strategies and techniques of news reporting, including research, investigation, the writing process, and publishing from an ethical and neutral position. This course provides excellent preparation for college-level writing in any academic discipline. Students also learn how to be discerning consumers of media and about the responsibility all citizens carry in maintaining a free national press."
    },
    {
      "id": "1463",
      "title": "British Literature",
      "department": "English",
      "credits": 0.5,
      "grade_levels": [11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Literature", "British Culture", "History"],
      "prerequisites": "English 11 and/or teacher recommendation",
      "description": "Students benefit from having a good background in British literature and an understanding of the historical perspective of literary works. In this course, students read and discuss major works of prose and poetry from the following periods: Anglo-Saxon, Medieval, Elizabethan, Renaissance, the Enlightenment, Romantic, Victorian, Modern, and Contemporary."
    },
    {
      "id": "1464",
      "title": "World Literature",
      "department": "English",
      "credits": 0.5,
      "grade_levels": [11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Literature", "World Cultures", "Global Perspectives"],
      "prerequisites": "English 11 and/or teacher recommendation",
      "description": "World Literature is a survey course. It covers significant works of the Hebrews, Greeks, Romans, Middle Ages, Renaissance, and Nineteenth Century. Students engage in extensive reading and writing."
    },
    {
      "id": "1466",
      "title": "Multicultural Literature",
      "department": "English",
      "credits": 0.5,
      "grade_levels": [11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Literature", "Cultural Studies", "Diversity"],
      "prerequisites": "English 11 and/or English teacher recommendation",
      "description": "The aim of this course is to follow Atticus's advice from To Kill a Mockingbird. Together, we will study novels, memoirs, films, and other works to gain insight into the lives of people whose cultures, belief systems, and traditions may be different from our own. We will engage in discussion, complete projects, and use writing to enhance our study. Our goal is to achieve a heightened empathy for and understanding of the world we live in, our fellow (global) citizens, and ourselves."
    },
    {
      "id": "1469",
      "title": "American Cultural & Media Studies",
      "department": "English",
      "credits": 0.5,
      "grade_levels": [11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Media", "American Culture", "Critical Thinking"],
      "prerequisites": "English 11 and/or teacher recommendation",
      "description": "American culture and media are rife with images and information that are constructed views of reality. In order to be critical thinkers, students must be aware of the techniques and content used in the production of media, as those techniques and content influence the state of contemporary American culture. American Cultural & Media Studies will explore the language, vocabulary, and techniques by which ideas and information are transmitted."
    },
    {
      "id": "1470",
      "title": "Public Speaking",
      "department": "English",
      "credits": 0.5,
      "grade_levels": [11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Communication", "Public Speaking", "Leadership"],
      "prerequisites": "English 11 and/or teacher recommendation",
      "description": "Public Speaking Class is a semester course that focuses on overcoming fears of public speaking and prepares students for careers, college, and times during life when speaking to an audience, large or small, is expected. Public speaking provides training in a variety of personal and social competencies. In this course, students will learn to manage fears of communicating in a public setting, develop greater self-confidence and self-presentation skills."
    },
    {
      "id": "1471",
      "title": "Fantasy & Science Fiction",
      "department": "English",
      "credits": 0.5,
      "grade_levels": [11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Literature", "Fantasy", "Science Fiction"],
      "prerequisites": "English 11 and/or teacher recommendation",
      "description": "Fantasy and Science Fiction is a course that delves into the literature of the recent and ancient (or imagined) past and the far future. Magic, wizards, and heroic quests are some of the elements of science fiction and fantasy, a genre that constitutes some of the most popular stories of our time. Yet authors of the great works in this genre were and are also deeply concerned with fundamental questions of morality, the purpose of human existence, and the strength of the human spirit."
    },
    {
      "id": "1472",
      "title": "Sports Literature",
      "department": "English",
      "credits": 0.5,
      "grade_levels": [11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Literature", "Sports", "American Culture"],
      "prerequisites": "English 11 and/or teacher recommendation",
      "description": "This course explores the world of athletics and its impact on society as a whole. Some of the questions presented for critical analysis may include: Why have sporting events taken on such an important role in the lives of so many Americans? How is the perception of what it means to be an American connected to sports? How have sports served as a vehicle for social change in America?"
    },
    {
      "id": "1473",
      "title": "Environmental Literature",
      "department": "English",
      "credits": 0.5,
      "grade_levels": [11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Literature", "Environment", "Nature Writing"],
      "prerequisites": "English 11 and/or teacher recommendation",
      "description": "Nature has been, for hundreds of years, a central focus, image, force, and symbol in literature. Environmental Literature is a course that focuses on the philosophy, observations, and activism of environmental writers. Students will learn how to read carefully and write thoughtfully about and alongside these writers to enhance their understanding of how and why environmental literature impacts its reader and society as a whole."
    },
    {
      "id": "1474",
      "title": "Introduction to Poetry",
      "department": "English",
      "credits": 0.5,
      "grade_levels": [11, 12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Literature", "Poetry", "Creative Expression"],
      "prerequisites": "English 11 and/or teacher recommendation",
      "description": "In this survey course, students will explore the rich world of poetry from various cultures, time periods, and styles. Students will develop skills in reading, analyzing, and appreciating poetry while also having opportunities to write their own original poems."
    },
    {
      "id": "9790",
      "title": "New Visions: Health Related Careers",
      "department": "New Visions",
      "credits": 4,
      "grade_levels": [12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Honors"],
      "interest_areas": ["Health Sciences", "Medical Careers", "Internship"],
      "prerequisites": "Application required - see counselor",
      "description": "Connections - Health Related Careers (New Visions) gives honors-level seniors the opportunity to observe all aspects of the medical field in action. Students spend the year at either the Buffalo Niagara Medical Campus, Millard Fillmore Hospital or Oishei Children's Hospital working with medical professionals in the areas of their interest. Students receive English 12 (1 Credit), Government (.5 Credit), Economics (.5 Credits), Internship (1 Credit), Health Related Careers (1 Credit). Located on-site at one of these medical facilities, students must provide their own transportation."
    },
    {
      "id": "9830",
      "title": "New Visions: Diesel Technology",
      "department": "New Visions",
      "credits": 4,
      "grade_levels": [12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Various"],
      "interest_areas": ["Technology", "Automotive", "Career Preparation"],
      "prerequisites": "Application required - see counselor",
      "description": "Diesel Technology is a one year Tech Prep Program that connects qualified, highly motivated high school seniors with professionals in the workplace. This competitive, off-site program provides unique training with nationally recognized partners. Start training in diesel today with real-world, hands-on experiences. Diesel Technology will train students to apply knowledge and skills to a wide range of diesel-powered equipment. Students receive English 12 (1 Credit), Government (.5 Credit), Economics (.5 Credits), Internship (1 Credit), Diesel Technology (1 Credit). Located on-site at Conway Beam Truck Group facilities, students must provide their own transportation."
    },
    {
      "id": "9840",
      "title": "New Visions: Education Pathways Academy",
      "department": "New Visions",
      "credits": 4,
      "grade_levels": [12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Honors"],
      "interest_areas": ["Education", "Teaching", "Career Exploration"],
      "prerequisites": "Application required - see counselor",
      "description": "Our Education Pathways Academy program provides students the opportunity to learn education terminology and frameworks, technology, structure, mandates, and services. Students will participate in rotations in a variety of educational settings including elementary, middle, and high school, as well as specialty areas such as special education, music, art, occupational and physical therapy, speech, counseling, and administration. Students receive English 12 (1 Credit), Government (.5 Credit), Economics (.5 Credits), Internship (1 Credit), Education (1 Credit). Located on-site at Buffalo State University facilities, students must provide their own transportation."
    },
    {
      "id": "9850",
      "title": "New Visions: Legal Academy",
      "department": "New Visions",
      "credits": 4,
      "grade_levels": [12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Honors"],
      "interest_areas": ["Law", "Criminal Justice", "Legal Studies"],
      "prerequisites": "Application required - see counselor",
      "description": "Legal Academy gives honors-level seniors the opportunity to experience criminal justice and law-related fields while on campus at Canisius College and UB. Students will also develop a network of professional connections through extensive field experiences across Western New York. Students receive English 12 (1 Credit), Government (.5 Credit), Economics (.5 Credits), Internship (1 Credit), Legal Studies (1 Credit). Located on-site at Canisius University and University at Buffalo facilities, students must provide their own transportation."
    },
    {
      "id": "9860",
      "title": "New Visions: Plant Science",
      "department": "New Visions",
      "credits": 4,
      "grade_levels": [12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Honors"],
      "interest_areas": ["Plant Science", "Horticulture", "Environmental Science"],
      "prerequisites": "Application required - see counselor",
      "description": "Our Plant Science program is a one-year, senior level program that incorporates contemporary knowledge, skills and practices found in the horticulture, floral and landscaping industries. Students receive English 12 (1 Credit), Government (.5 Credit), Economics (.5 Credits), Internship (1 Credit), Plant Science (1 Credit). Located on-site at Buffalo & Erie County Botanical Garden facilities, students must provide their own transportation."
    },
    {
      "id": "9793",
      "title": "New Visions: Zoo, Wildlife, and Conservation Careers",
      "department": "New Visions",
      "credits": 4,
      "grade_levels": [12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Honors"],
      "interest_areas": ["Wildlife Biology", "Conservation", "Animal Care"],
      "prerequisites": "Application required - see counselor",
      "description": "Zoo Wildlife and Conservation Careers is a program for honors-level seniors. Students in this program consider the 23-acre Buffalo Zoo their home and explore the many career possibilities in animal care, wildlife conservation and zoo operations. Students receive English 12 (1 Credit), Government (.5 Credit), Economics (.5 Credits), Internship (1 Credit), Wildlife Conservation (1 Credit). Located on-site at Buffalo Zoo facilities, students must provide their own transportation."
    },
    {
      "id": "9792",
      "title": "New Visions: Precision Manufacturing & Engineering",
      "department": "New Visions",
      "credits": 4,
      "grade_levels": [12],
      "diploma_types": ["regents", "advanced_regents"],
      "academic_levels": ["Honors"],
      "interest_areas": ["Engineering", "Manufacturing", "Technology"],
      "prerequisites": "Application required - see counselor",
      "description": "The half-day program allows students to spend the morning working alongside machinists, technicians and engineers in various aspects/phases of production. The goal of the program is for students to develop a complete foundation of the precision manufacturing process, from design to fabrication. Together with regional partners including PCB Piezotronics, Inc., SUNY Erie and Niagara County Community College, New Visions will help prepare the workforce of the future  today. Located on-site at PCB Piezotronics facilities, students must provide their own transportation."
    }
  ]
} 